//**********************************************************************************
//
//                              Camera Program
//
//      Copyright (c) 2014 - 2026 AVAL DATA Corporation All Right Reserved.
//
// The distribution policy is described in the file "COPYING"
// furnished with this package.
//
// camera.c - Camera Program
//**********************************************************************************

//----------------------------------------------------------------------------------
// includes
//----------------------------------------------------------------------------------
#include "../Common/common.h"


//**********************************************************************************
//	Get Width Min
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int WidthMin (void)
{
	return (CAMERA_WIDTH_MIN);
}


//**********************************************************************************
//	Get Height Min
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int HeightMin (void)
{
	return (CAMERA_HEIGHT_MIN);
}


//**********************************************************************************
//	Get Width Max
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int WidthMax (void)
{
	return (CAMERA_WIDTH_MAX);
}


//**********************************************************************************
//	Get Height Max
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int HeightMax (void)
{
	return (CAMERA_HEIGHT_MAX);
}


//**********************************************************************************
//	Get Sensor Width
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int sensorWidth (void)
{
	return (IMG_WIDTH);
}


//**********************************************************************************
//	Get Sensor Height
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		Width Size
//==================================================================================
int sensorHeight (void)
{
	return (IMG_HEIGHT);
}


//**********************************************************************************
//	Get Camera Type(Area/Line)
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		pType				：Camera Typeを格納するポインタ
//	[ OUTPUT ]
//		AVAL_STATUS_SUCCESS	：正常終了
//		上記以外				：異常終了
//==================================================================================
int cameraGetType (int *pType)
{
	int status = AVAL_STATUS_SUCCESS;

	// Check pType Parameter
	if (pType == NULL)
	{
		status = MAKE_ERROR_STATUS (AVAL_STATUS_CAMERA, AVAL_STATUS_INVALID_PARAMETER);
		cameraLogMsg (MSG_LEVEL_ERROR, __FILE__, __func__, __LINE__, status, "Camera Type pType NULL Parameter Error.\n");
		goto _DONE;
	}

	// Camera Type
	*pType = CAMERA_TYPE;

_DONE:
	return (status);
}


//**********************************************************************************
//	Cache Flush
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		AVAL_STATUS_SUCCESS	：正常終了
//		上記以外				：異常終了
//==================================================================================
int cacheFlush (void)
{
	int status = AVAL_STATUS_SUCCESS;
	return (status);
}


//**********************************************************************************
//	Cache Flush Range
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		adrs				：Cache Flushするアドレス
//		adrs				：Cache Flushするサイズ
//	[ OUTPUT ]
//		AVAL_STATUS_SUCCESS	：正常終了
//		上記以外				：異常終了
//==================================================================================
int cacheFlushRange (unsigned int adrs, unsigned int size)
{
	int status = AVAL_STATUS_SUCCESS;
	//__asm volatile ("cbo.flush (%0)" :  : "r"(adrs) : "memory");
	return (status);
}


//**********************************************************************************
//	Cache Flush Range
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		adrs				：Cache Flushするアドレス
//		adrs				：Cache Flushするサイズ
//	[ OUTPUT ]
//		AVAL_STATUS_SUCCESS	：正常終了
//		上記以外				：異常終了
//==================================================================================
int cacheInvalidateRange (unsigned int adrs, unsigned int size)
{
	int status = AVAL_STATUS_SUCCESS;
	return (status);
}

// eof
