//**********************************************************************************
//
//                               Camera Program
//
//      Copyright (c) 2014- 2026 AVAL DATA Corporation All Right Reserved.
//
// The distribution policy is described in the file "COPYING"
// furnished with this package.
//
// special.c - Special Initialize Program
//**********************************************************************************


//----------------------------------------------------------------------------------
// includes
//----------------------------------------------------------------------------------
#include "../Common/common.h"


//**********************************************************************************
//	特殊な初期化
//----------------------------------------------------------------------------------
//	[ INPUT ]
//		-
//	[ OUTPUT ]
//		AVAL_STATUS_SUCCESS	：正常終了
//		上記以外				：異常終了
//==================================================================================
int specialInitialize (void)
{
	return (AVAL_STATUS_SUCCESS);
}

// eof
